app/controllers/articles_controller.rb

  def show
   @articles=Article.find(params[:id])
---
SELECT  "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    #render plain:params[:aricles].inspect
    @articals = Article.new(artical_params)
    @articals.save
---
INSERT INTO "articles" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "A"], ["text", "efe 45 4"], ["created_at", "2017-06-26 10:25:41.780424"], ["updated_at", "2017-06-26 10:25:41.780424"]]